// 変数numberを定義してください
let number = 0;

// 変数numberに1を加えて、その後に変数numberの値を出力してください
number += 1;
console.log(number);

// 上述の2行のコードを4回、貼り付けてください
number += 1;
console.log(number);
number += 1;
console.log(number);
number += 1;
console.log(number);
number += 1;
console.log(number);

//------------------------------------------------------------------------------------------------------//

// 変数numberを定義してください
let number1 = 1;

// while文を作成してください
while (number1 <= 100) {
  console.log(number1);
  number1 += 1;
}

//------------------------------------------------------------------------------------------------------//

// for文を用いて、1から100までの数字を出力してください
//()の中は、①変数の定義 ②条件式 ③変数の更新 の順で書く

for (let number = 1; number <= 100; number ++) {
    console.log(number);
}

//------------------------------------------------------------------------------------------------------//

// for文を完成させてください
for (let number = 1; number <= 100; number ++) {
    // if文を用いて、numberが3の倍数の時に「3の倍数です」、そうでないときは数字を出力してください
    if (number % 3 == 0) {
      console.log('3の倍数です');
    } else {
      console.log(number);
    }
}

//------------------------------------------------------------------------------------------------------//

